#!/bin/bash

file_name=$1
_nic=$2
_ip=$3
_netmask=$4

cat > ./$file_name <<EOF

echo "
################################################################################
#
#   Green Client VM :: User Data Action
#
################################################################################
"

# ToDo List
# 근본적으로는 3, 4, 5번이 리부팅이 되어도 실행되게 해야함.
# 그리고 vm을 생성할때 IP를 고정시켜야 함. 그래야 5번이 확실함.

echo "
# ---------------------------------------------------
# 1. install bridge-utils to use brctl commands
# ---------------------------------------------------
"

apt-get -y update
apt-get -y install bridge-utils    
apt-get -y install iperf

echo "
# --------------------------------------------------- 
# 2. green nic activate & attach IP
# ---------------------------------------------------
"
# green nic 
# ifconfig eth1 192.168.0.2 netmask 255.255.255.0 up
ifconfig $_nic $_ip netmask $_netmask up
    
echo "
################################################################################
#
#   End User Data Action
#
################################################################################
"

EOF